In [ ]:
# Distinct, duplicates

In [1]:
import pandas as pd

In [2]:
df_csv = pd.read_csv('C:/Users/KAMPLI ENTERPRISES/PycharmProjects/Files/Customers.csv')

In [4]:
df_csv.shape

(100, 11)

In [5]:
len(df_csv.columns)

11

In [6]:
len(df_csv)

100

In [7]:


df_csv['First Name']

0       Sheryl
1      Preston
2          Roy
3        Linda
4       Joanna
        ...
95        Karl
96        Lynn
97        Fred
98      Yvonne
99    Clarence
Name: First Name, Length: 100, dtype: object

In [10]:
# Find distinct values in columns
df_csv['First Name'].unique()

array(['Sheryl', 'Preston', 'Roy', 'Linda', 'Joanna', 'Aimee', 'Darren',
       'Brett', 'Michelle', 'Carl', 'Jenna', 'Tracey', 'Kristine',
       'Faith', 'Miranda', 'Caroline', 'Greg', 'Clifford', 'Maxwell',
       'Kiara', 'Colleen', 'Janet', 'Shane', 'Marcus', 'Dakota',
       'Frederick', 'Stefanie', 'Kent', 'Jack', 'Tom', 'Gabriel',
       'Kaitlyn', 'Tammie', 'Nicholas', 'Jordan', 'Bruce', 'Sherry',
       'Natalie', 'Bryan', 'Wayne', 'Luis', 'Rhonda', 'Joanne',
       'Geoffrey', 'Gloria', 'Brady', 'Latoya', 'Gerald', 'Samuel',
       'Patricia', 'Stacie', 'Robin', 'Ralph', 'Phyllis', 'Danny',
       'Kathy', 'Kelli', 'Lynn', 'Shelley', 'Eddie', 'Chloe', 'Eileen',
       'Fernando', 'Makayla', 'Virginia', 'Riley', 'Alexandria',
       'Richard', 'Candice', 'Anita', 'Regina', 'Debra', 'Brittany',
       'Cassidy', 'Laurie', 'Alejandro', 'Leslie', 'Kathleen', 'Hunter',
       'Chad', 'Corey', 'Emma', 'Duane', 'Alison', 'Vernon', 'Lori',
       'Nina', 'Collin', 'Darrell', 'Karl', 'Fred', 'Yvonne', 'Clarence'],
      dtype=object)

In [11]:
len(df_csv['First Name'].unique())

93

In [19]:
# Find duplicate values
df_dup = pd.read_csv('C:/Users/KAMPLI ENTERPRISES/PycharmProjects/Files/Customers_dup.csv')
df_dup.duplicated()

0      False
1      False
2       True
3      False
4      False
       ...
96     False
97     False
98     False
99     False
100    False
Length: 101, dtype: bool

In [20]:
# Print the duplicate values
df_dup[df_dup_csv.duplicated()]

,Customer Id,First Name,Last Name,Company,City,Country,Phone 1,Phone 2,Email,Subscription Date,Website
2,1Ef7b82A4CAAD10,Preston,Lozano,Vega-Gentry,East Jimmychester,Djibouti,5153435776,686-620-1820x944,vmata@colon.com,4/23/2021,http://www.hobbs.com/

In [24]:
# Write duplicate values to a csv file
df_duplicated = df_dup[df_dup_csv.duplicated()]
df_duplicated.to_csv('dupvalues.csv')

In [25]:
# Using a small file for MAx and Min
df = pd.read_excel('C:/Users/KAMPLI ENTERPRISES/PycharmProjects/Files/Orders.xlsx')

In [26]:
df

,Order ID,Order Date,Order Quantity,Sales,Ship Mode,Profit,Unit Price,Customer Name,Customer Segment,Product Category
0,3,2010-10-13,6,261.5400,Regular Air,-213.250,38.94,Muhammed MacIntyre,Small Business,Office Supplies
1,6,2012-02-20,2,6.9300,Regular Air,-4.640,2.08,Ruben Dartt,Corporate,Office Supplies
2,32,2011-07-15,26,2808.0800,Regular Air,1054.820,107.53,Liz Pelletier,Corporate,Furniture
3,32,2011-07-15,24,1761.4000,Delivery Truck,-1748.560,70.89,Liz Pelletier,Corporate,Furniture
4,32,2011-07-15,23,160.2335,Regular Air,-85.129,7.99,Liz Pelletier,Corporate,Technology
5,32,2011-07-15,15,140.5600,Regular Air,-128.380,8.46,Liz Pelletier,Corporate,Technology
6,35,2011-10-22,30,288.5600,Regular Air,60.720,9.11,Julie Creighton,Corporate,Office Supplies
7,35,2011-10-22,14,1892.8480,Regular Air,48.987,155.99,Julie Creighton,Corporate,Technology
8,36,2011-11-02,46,2484.7455,Regular Air,657.477,65.99,Sample Company A,Home Office,Technology
9,65,2011-03-17,32,3812.7300,Regular Air,1470.300,115.79,Tamara Dahlen,Corporate,Technology

In [27]:
# FInd max Order QUantity
df['Order Quantity'].nlargest(1)

8    46
Name: Order Quantity, dtype: int64

In [28]:
# Top 2
df['Order Quantity'].nlargest(2)

8    46
9    32
Name: Order Quantity, dtype: int64

In [29]:
# SMallest
df['Order Quantity'].nsmallest(2)

1    2
0    6
Name: Order Quantity, dtype: int64

In [30]:
# FInd values for Order Quantity >= 30

filt = (df['Order Quantity'] >= 30)

In [32]:
df[filt]

,Order ID,Order Date,Order Quantity,Sales,Ship Mode,Profit,Unit Price,Customer Name,Customer Segment,Product Category
6,35,2011-10-22,30,288.5600,Regular Air,60.720,9.11,Julie Creighton,Corporate,Office Supplies
8,36,2011-11-02,46,2484.7455,Regular Air,657.477,65.99,Sample Company A,Home Office,Technology
9,65,2011-03-17,32,3812.7300,Regular Air,1470.300,115.79,Tamara Dahlen,Corporate,Technology